In [1]:
import pandas as pd
import numpy as np

In [2]:
busyness_by_week_month = pd.read_csv('../../data/raw/date_origin_dest.csv')
busyness_by_week_month.head()

      fl_date origin dest
0  2019-07-12    MSP  LSE
1  2019-07-12    MSP  LSE
2  2019-07-12    DTW  LSE
3  2019-07-12    LSE  DTW
4  2019-07-12    DTW  FWA

In [3]:
# Create a column with the day/month/year of the flight
busyness_by_week_month['Flight Weekday'] = pd.DatetimeIndex(busyness_by_week_month['fl_date']).weekday   #0: Monday, 1:Tuesday, etc.
busyness_by_week_month['Flight Day'] = pd.DatetimeIndex(busyness_by_week_month['fl_date']).day
busyness_by_week_month['Flight Month'] = pd.DatetimeIndex(busyness_by_week_month['fl_date']).month
busyness_by_week_month['Flight Year'] = pd.DatetimeIndex(busyness_by_week_month['fl_date']).year
busyness_by_week_month.head()

,fl_date,origin,dest,Flight Weekday,Flight Day,Flight Month,Flight Year
0,2019-07-12,MSP,LSE,4,12,7,2019
1,2019-07-12,MSP,LSE,4,12,7,2019
2,2019-07-12,DTW,LSE,4,12,7,2019
3,2019-07-12,LSE,DTW,4,12,7,2019
4,2019-07-12,DTW,FWA,4,12,7,2019

In [4]:
busyness_by_week_month.columns

Index(['fl_date', 'origin', 'dest', 'Flight Weekday', 'Flight Day',
       'Flight Month', 'Flight Year'],
      dtype='object')

In [5]:
busyness_by_week_month.columns = ['Flight Date', 'origin', 'dest', 'Flight Weekday', 'Flight Day',
       'Flight Month', 'Flight Year']

In [6]:
departures = busyness_by_week_month[['Flight Date', 'origin', 'Flight Weekday', 'Flight Day', 'Flight Month', 'Flight Year']]
arrivals = busyness_by_week_month[['Flight Date', 'origin', 'Flight Weekday', 'Flight Day', 'Flight Month', 'Flight Year']]

In [7]:
departures.head()

  Flight Date origin  Flight Weekday  Flight Day  Flight Month  Flight Year
0  2019-07-12    MSP               4          12             7         2019
1  2019-07-12    MSP               4          12             7         2019
2  2019-07-12    DTW               4          12             7         2019
3  2019-07-12    LSE               4          12             7         2019
4  2019-07-12    DTW               4          12             7         2019

In [8]:
departures['num_flights'] = 1
departures.head()

,Flight Date,origin,Flight Weekday,Flight Day,Flight Month,Flight Year,num_flights
0,2019-07-12,MSP,4,12,7,2019,1
1,2019-07-12,MSP,4,12,7,2019,1
2,2019-07-12,DTW,4,12,7,2019,1
3,2019-07-12,LSE,4,12,7,2019,1
4,2019-07-12,DTW,4,12,7,2019,1

In [9]:
dep_busyness_scores_by_date = pd.pivot_table(data = departures, index=['Flight Date', 'origin','Flight Year','Flight Month','Flight Day','Flight Weekday'], values = 'num_flights', aggfunc='sum')
dep_busyness_scores_by_date = dep_busyness_scores_by_date.reset_index()
dep_busyness_scores_by_date.head()

,Flight Date,origin,Flight Year,Flight Month,Flight Day,Flight Weekday,num_flights
0,2018-01-01,ABE,2018,1,1,0,10
1,2018-01-01,ABI,2018,1,1,0,6
2,2018-01-01,ABQ,2018,1,1,0,80
3,2018-01-01,ABR,2018,1,1,0,2
4,2018-01-01,ABY,2018,1,1,0,2

In [10]:
dep_busyness_scores_by_date.columns = ['Flight Date', "origin", "Flight Year", "Flight Month", "Flight Day", "Flight Weekday", "Total Daily Departures"]
dep_busyness_scores_by_date.head()

,Flight Date,origin,Flight Year,Flight Month,Flight Day,Flight Weekday,Total Daily Departures
0,2018-01-01,ABE,2018,1,1,0,10
1,2018-01-01,ABI,2018,1,1,0,6
2,2018-01-01,ABQ,2018,1,1,0,80
3,2018-01-01,ABR,2018,1,1,0,2
4,2018-01-01,ABY,2018,1,1,0,2

In [11]:
dep_busyness_scores_by_date['departure_busyness_id'] = dep_busyness_scores_by_date['origin'] + '-' + dep_busyness_scores_by_date['Flight Month'].astype(str)+ '-' + dep_busyness_scores_by_date['Flight Weekday'].astype(str)
dep_busyness_scores_by_date.head()

,Flight Date,origin,Flight Year,Flight Month,Flight Day,Flight Weekday,Total Daily Departures,departure_busyness_id
0,2018-01-01,ABE,2018,1,1,0,10,ABE-1-0
1,2018-01-01,ABI,2018,1,1,0,6,ABI-1-0
2,2018-01-01,ABQ,2018,1,1,0,80,ABQ-1-0
3,2018-01-01,ABR,2018,1,1,0,2,ABR-1-0
4,2018-01-01,ABY,2018,1,1,0,2,ABY-1-0

In [12]:
dep_busyness_scores_by_date.columns

Index(['Flight Date', 'origin', 'Flight Year', 'Flight Month', 'Flight Day',
       'Flight Weekday', 'Total Daily Departures', 'departure_busyness_id'],
      dtype='object')

In [13]:
avg_dep_busyness = dep_busyness_scores_by_date[['origin', 'Total Daily Departures','departure_busyness_id']]
avg_dep_busyness.head()

  origin  Total Daily Departures departure_busyness_id
0    ABE                      10               ABE-1-0
1    ABI                       6               ABI-1-0
2    ABQ                      80               ABQ-1-0
3    ABR                       2               ABR-1-0
4    ABY                       2               ABY-1-0

In [14]:
avg_dep_busyness = pd.pivot_table(data = avg_dep_busyness, index = 'departure_busyness_id', values = 'Total Daily Departures')
avg_dep_busyness = avg_dep_busyness.reset_index()
avg_dep_busyness.head()

  departure_busyness_id  Total Daily Departures
0               ABE-1-0               13.888889
1               ABE-1-1               11.800000
2               ABE-1-2               12.900000
3               ABE-1-3               14.111111
4               ABE-1-4               14.125000

In [15]:
avg_dep_busyness.columns = ['departure_busyness_id','Average Daily Departures']
avg_dep_busyness.head()

  departure_busyness_id  Average Daily Departures
0               ABE-1-0                 13.888889
1               ABE-1-1                 11.800000
2               ABE-1-2                 12.900000
3               ABE-1-3                 14.111111
4               ABE-1-4                 14.125000

In [16]:
dep_busyness_scores_by_date = dep_busyness_scores_by_date.drop(labels=['Flight Year', 'Flight Month', 'Flight Day', 'Flight Weekday'], axis=1)
dep_busyness_scores_by_date.head()

  Flight Date origin  Total Daily Departures departure_busyness_id
0  2018-01-01    ABE                      10               ABE-1-0
1  2018-01-01    ABI                       6               ABI-1-0
2  2018-01-01    ABQ                      80               ABQ-1-0
3  2018-01-01    ABR                       2               ABR-1-0
4  2018-01-01    ABY                       2               ABY-1-0

In [17]:
# dep_busyness_scores_by_date = dep_busyness_scores_by_date.drop(labels='origin', axis=1)
# dep_busyness_scores_by_date.head()

In [18]:
dep_busyness_scores_by_date = pd.merge(dep_busyness_scores_by_date, avg_dep_busyness, on = 'departure_busyness_id', how = 'left')

In [19]:
dep_busyness_scores_by_date.head()

,Flight Date,origin,Total Daily Departures,departure_busyness_id,Average Daily Departures
0,2018-01-01,ABE,10,ABE-1-0,13.888889
1,2018-01-01,ABI,6,ABI-1-0,5.888889
2,2018-01-01,ABQ,80,ABQ-1-0,70.555556
3,2018-01-01,ABR,2,ABR-1-0,1.888889
4,2018-01-01,ABY,2,ABY-1-0,2.888889

In [20]:
dep_busyness_scores_by_date.columns

Index(['Flight Date', 'origin', 'Total Daily Departures',
       'departure_busyness_id', 'Average Daily Departures'],
      dtype='object')

In [21]:
#rearranage columns
dep_busyness_scores_by_date = dep_busyness_scores_by_date[['Flight Date', 'origin', 'departure_busyness_id', 'Total Daily Departures', 'Average Daily Departures']]
dep_busyness_scores_by_date.head()

,Flight Date,origin,departure_busyness_id,Total Daily Departures,Average Daily Departures
0,2018-01-01,ABE,ABE-1-0,10,13.888889
1,2018-01-01,ABI,ABI-1-0,6,5.888889
2,2018-01-01,ABQ,ABQ-1-0,80,70.555556
3,2018-01-01,ABR,ABR-1-0,2,1.888889
4,2018-01-01,ABY,ABY-1-0,2,2.888889

In [22]:
dep_busyness_scores_by_date['dep_busyness_score'] = dep_busyness_scores_by_date['Total Daily Departures'] / dep_busyness_scores_by_date['Average Daily Departures']
dep_busyness_scores_by_date.head()

,Flight Date,origin,departure_busyness_id,Total Daily Departures,Average Daily Departures,dep_busyness_score
0,2018-01-01,ABE,ABE-1-0,10,13.888889,0.720000
1,2018-01-01,ABI,ABI-1-0,6,5.888889,1.018868
2,2018-01-01,ABQ,ABQ-1-0,80,70.555556,1.133858
3,2018-01-01,ABR,ABR-1-0,2,1.888889,1.058824
4,2018-01-01,ABY,ABY-1-0,2,2.888889,0.692308

In [23]:
dep_busyness_scores_by_date = dep_busyness_scores_by_date.drop(labels = ['Total Daily Departures', 'Average Daily Departures', 'departure_busyness_id'], axis=1)

In [24]:
dep_busyness_scores_by_date.head()

  Flight Date origin  dep_busyness_score
0  2018-01-01    ABE            0.720000
1  2018-01-01    ABI            1.018868
2  2018-01-01    ABQ            1.133858
3  2018-01-01    ABR            1.058824
4  2018-01-01    ABY            0.692308

In [32]:
dep_busyness_scores_by_date.columns = ['Flight Date', 'Origin Airport (IATA Code)', 'Departure Busyness Score']
dep_busyness_scores_by_date.head()

  Flight Date Origin Airport (IATA Code)  Departure Busyness Score
0  2018-01-01                        ABE                  0.720000
1  2018-01-01                        ABI                  1.018868
2  2018-01-01                        ABQ                  1.133858
3  2018-01-01                        ABR                  1.058824
4  2018-01-01                        ABY                  0.692308

In [33]:
dep_busyness_scores_by_date.to_csv('../../data/processed/departure_busyness_scores.csv')

In [25]:
# departures_by_day = pd.pivot_table(data = departures, index = ["origin", "Flight Year", "Flight Month", "Flight Day", "Flight Weekday"], values = 'num_flights', aggfunc='count')
# departures_by_day = departures_by_day.reset_index()
# departures_by_day

In [26]:
# departures_by_day.sort_values("num_flights", ascending=False)

In [27]:
# departures_by_day.info()

In [28]:
# avg_departures_by_day = pd.pivot_table(data = departures_by_day, index = ["origin", "Flight Month", "Flight Weekday"], values = "num_flights")
# avg_departures_by_day = avg_departures_by_day.reset_index()
# avg_departures_by_day.sort_values("num_flights", ascending=False)

In [29]:
# avg_departures_by_day['departure_busyness_id'] = avg_departures_by_day['origin'] + '-' + avg_departures_by_day['Flight Month'].astype(str)+ '-' + avg_departures_by_day['Flight Weekday'].astype(str)
# avg_departures_by_day.head()

In [30]:
# arrivals.head()

In [31]:
# arrivals['num_flights'] = 1
# arrivals.head()